In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
dframe = DataFrame({'k1':['X', 'X', 'Y', 'Y', 'Z'],
                   'k2':['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [4]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.341662 -0.253912
1  X   beta  2.015083 -0.037538
2  Y  alpha  0.380150  0.096790
3  Y   beta -0.903565  0.562374
4  Z  alpha -0.070097  0.533464

In [6]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [7]:
group1.mean()

k1
X    0.836710
Y   -0.261708
Z   -0.070097
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [9]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB    2.015083
    JAN    0.380150
NY  FEB   -0.903565
    JAN   -0.205879
Name: dataset1, dtype: float64

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.341662 -0.253912
1  X   beta  2.015083 -0.037538
2  Y  alpha  0.380150  0.096790
3  Y   beta -0.903565  0.562374
4  Z  alpha -0.070097  0.533464

In [11]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.836710 -0.145725
Y  -0.261708  0.329582
Z  -0.070097  0.533464

In [12]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.341662 -0.253912
   beta   2.015083 -0.037538
Y  alpha  0.380150  0.096790
   beta  -0.903565  0.562374
Z  alpha -0.070097  0.533464

In [13]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [16]:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name)
    print (group)
    print ('/n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.341662 -0.253912
1  X   beta  2.015083 -0.037538
/n
This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.380150  0.096790
3  Y   beta -0.903565  0.562374
/n
This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.070097  0.533464
/n

In [18]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print ("Key1 = %s Key2 = %s" %(k1,k2))
    print (group)
    print ('/n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.341662 -0.253912
/n
Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  2.015083 -0.037538
/n
Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha   0.38015   0.09679
/n
Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.903565  0.562374
/n
Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.070097  0.533464
/n

In [19]:
group_dict = dict(list(dframe.groupby('k1')))

In [20]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.341662 -0.253912
1  X   beta  2.015083 -0.037538

In [21]:
group_dict_axis_1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [22]:
group_dict_axis_1

{dtype('float64'):    dataset1  dataset2
 0 -0.341662 -0.253912
 1  2.015083 -0.037538
 2  0.380150  0.096790
 3 -0.903565  0.562374
 4 -0.070097  0.533464, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [23]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.253912
   beta  -0.037538
Y  alpha  0.096790
   beta   0.562374
Z  alpha  0.533464